app/controllers/accounts_controller.rb

  def update_password
    if current_user&.authenticate(params[:user][:current_password])
      if current_user.update(password: params[:user][:new_password])
---
UPDATE "users" SET "password_digest" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["password_digest", "$2a$12$BpR26pNd601hR./tY8lX4OctO2dwwISuo3gK4Yc0w0cKuXoVKxTF6"], ["updated_at", "2023-11-30 17:24:58.069761"], ["id", 1]]