app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"

  def confirm_email
    user = User.find_by(confirmation_token: params[:confirmation_token])
---
SELECT  "users".* FROM "users" WHERE "users"."confirmation_token" = 'MyzG0RPWWoYT-U0SAY2hyg' LIMIT 1